load_tests/script.yml
# my-scenario.yml
config:
  target: "http://143.244.143.27:3000"
  phases:
    - duration: 60
      arrivalRate: 60
  engines:
   socketio-v3: {}

scenarios:
  - name: My sample scenario
    engine: socketio-v3
    flow:
      # emit an object
      - emit:
          channel: "message"
          data:
            id: 42`
            status: "in progress"
            tags:
              - "tag1"
              - "tag2"